#### Querying with `.query()`
The `.query()` method in pandas lets you filter DataFrame rows using string expression -- It's more readable and often more concise alternative to using boolean masking.

This is a cleaner, SQL-like way to filter:
```Python
df.query("Age > 25 and city == 'Delhi'")
```

In [2]:
import pandas as pd

data = {
    'name':['Alice', 'Bob', 'Charlie'],
    'age': [20, 25, 29],
    'city': ['Mumbai', 'Delhi', 'Pune']
}

df = pd.DataFrame(data)

df.query("age > 25 and city == 'Pune'")

      name  age  city
2  Charlie   29  Pune

Dynamic Column names:

In [3]:
col = 'age'
df.query(f'{col} > 25')

      name  age  city
2  Charlie   29  Pune

---

Here are the main rules and tips for using `.query()` in pandas:

**1. Column names become variables**

You can reference column names directly in the query string:

In [4]:
df.query("name == 'Bob'")

  name  age   city
1  Bob   25  Delhi

---

**2. String values must be in quotes**

Use single or double quotes around strings in expressions:

In [5]:
df.query("city == 'Mumbai'")

    name  age    city
0  Alice   20  Mumbai

---

**3. Use backticks for column names with spaces or special characters**

if a column names has space, use backticks(`):

```Python
df.query("first name == 'Alice'")
```

---

**4. You can use @ to reference Python variables**

To pass external variables into `.query()`

In [6]:
age_limit = 25
df.query("age > @age_limit")

      name  age  city
2  Charlie   29  Pune

---

**5. Logical operators**

Use these: `and`, `or`, `not` -- instead of `&`, `|`, `~`

Bad:
```Python
df.query("age > 30 & city == 'Delhi'")    # ❌
```

Good:
```Python
df.query("age > 30 and city == 'Delhi'")   # ✅

---

**6. Chained Comparisons**

Just like Python:

In [7]:
df.query("25 < age <= 40")

      name  age  city
2  Charlie   29  Pune

---

**7. Avoid using reserved keywords as column names**

If you have column named `class`, `lambda`, etc. You'll need to use backticks:

**8. Case-Sensitive**

Column names and string values are case-sensitive

**9. `.query()` returns a copy, not a view**

The result is a new DataFrame. changes won't affect the original unless reassigned.